StoveOpt/tests/test_results/case_6666666667/0/details
Velocity
66.66666667